In [14]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d import Axes3D

In [38]:
food_prod = pd.read_csv('Africa Food Production (2004 - 2013).csv')
food_supply = pd.read_csv('Africa Food Supply (2004 - 2013).csv')

In [16]:
food_prod.head()

   Country                Item  Year  Value
0  Algeria  Wheat and products  2004   2731
1  Algeria  Wheat and products  2005   2415
2  Algeria  Wheat and products  2006   2688
3  Algeria  Wheat and products  2007   2319
4  Algeria  Wheat and products  2008   1111

In [25]:
food_supply.head()

   Country  Year  Value
0  Algeria  2004   2987
1  Algeria  2005   2958
2  Algeria  2006   3047
3  Algeria  2007   3041
4  Algeria  2008   3048

#### Question 1

In [18]:
food_prod.query('Item == "Oats" and Year == 2010', inplace = True)
food_prod.sort_values(by=['Value'], inplace=True,ascending=False)
food_prod.iloc[0]

Country    Algeria
Item          Oats
Year          2010
Value           88
Name: 46, dtype: object

#### Question 2

In [26]:
food_supply.query('Year >= 2004 & Year <= 2006', inplace = True)

In [27]:
supply_agg = food_supply.groupby(['Country']).agg({'Value':sum})

In [35]:
supply_agg.sort_values(by=['Value'], inplace=True,ascending=True)

In [37]:
supply_agg.head(3)

                          Value
Country
Zambia                     5577
Ethiopia                   5827
Central African Republic   6044

#### Question 5

In [40]:
food_prod.query('Year >= 2004 & Year <= 2013 & Item == "Rice (Milled Equivalent)"', inplace = True)

In [41]:
highest_rice_total = food_prod.groupby(['Country']).agg({'Value':sum})

In [43]:
highest_rice_total.sort_values(by=['Value'], inplace=True,ascending=False)

In [44]:
highest_rice_total.head(3)

            Value
Country
Egypt       40370
Nigeria     26964
Madagascar  26118